# BankSight: Transaction Intelligence Dashboard

In [2]:

import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

### import csv file

In [3]:
accounts = pd.read_csv("accounts.csv")
customers = pd.read_csv("customers.csv")
transactions = pd.read_csv("transactions.csv")

### import json file

In [4]:
loans = pd.read_json("loans.json")
credit_cards = pd.read_json("credit_cards.json")
tickets = pd.read_json("support_tickets.json")
branches = pd.read_json("branches.json", lines=True)

##### data import in libries

In [5]:
accounts.head()

  customer_id  account_balance         last_updated
0       C0001        293729.87  2025-05-24 09:46:29
1       C0002        150735.15  2025-05-24 09:46:29
2       C0003        170156.21  2025-05-24 09:46:29
3       C0004        311383.96  2025-05-24 09:46:29
4       C0005         60320.75  2025-05-24 09:46:29

In [6]:
customers.head()

,customer_id,name,gender,age,city,account_type,join_date
0,C0001,Richard Wilson,M,65,Kimberlyburgh,Savings,2023-08-27
1,C0002,Holly Parker,F,41,Port David,Current,2023-12-08
2,C0003,Megan Alvarez,M,46,West Laurieton,Savings,2022-05-25
3,C0004,Nicholas Stewart,F,39,Amyville,Current,2020-11-30
4,C0005,Douglas Anderson,M,70,New Craigport,Current,2023-01-29

In [7]:
transactions.head()

   txn_id customer_id    txn_type    amount             txn_time   status
0  T00001       C0363     deposit  44442.71  2025-02-14 06:26:00  success
1  T00002       C0432     deposit  15737.59  2025-03-27 07:21:21  success
2  T00003       C0084  withdrawal  82150.70  2024-07-31 18:28:06  success
3  T00004       C0067  withdrawal  20313.86  2024-11-11 12:18:47  success
4  T00005       C0485  withdrawal  74536.08  2025-04-15 10:52:59  success

In [8]:
branches.head()

,Branch_ID,Branch_Name,City,Manager_Name,Total_Employees,Branch_Revenue,Opening_Date,Performance_Rating
0,1,"Wang, Mcdonald and Church Branch",Kellitown,Kevin Jones,141,16849288.09,2008-08-01,2
1,2,Crawford-Torres Branch,Angelaburgh,Andrea Steele,39,5822279.32,2015-09-17,1
2,3,Bridges Inc Branch,Johnsonfort,Michael Coleman,195,2114594.03,2012-07-30,3
3,4,Garcia Group Branch,New Kyleberg,Dawn Cooper,144,3390389.63,2018-06-27,2
4,5,"Arroyo, Moore and Freeman Branch",West Coryborough,Samantha Kennedy,42,2771910.11,2012-01-04,5

In [9]:
credit_cards.head()

,Card_ID,Customer_ID,Account_ID,Branch,Card_Number,Card_Type,Card_Network,Credit_Limit,Current_Balance,Issued_Date,Expiry_Date,Status
0,1,1559,2090,Perez Ltd Branch,4960013389083863,Business,Visa,178393,39819.23,2015-04-13,2019-10-27,Expired
1,2,1160,2221,Miller Inc Branch,6511615594078161,Platinum,RuPay,416026,175818.58,2015-01-27,2018-12-18,Expired
2,3,1297,2082,"Miles, Patterson and Murray Branch",6316475255341928,Gold,RuPay,419398,29171.29,2021-06-22,2025-07-19,Active
3,4,1333,2058,"Shepard, Gonzales and Cooper Branch",3305641395376724,Gold,Amex,385544,265316.71,2019-04-04,2023-10-07,Active
4,5,1371,2225,Wilson PLC Branch,6287101226916697,Platinum,RuPay,274622,246561.92,2023-05-18,2029-08-26,Expired

In [10]:
loans.head()

,Loan_ID,Customer_ID,Account_ID,Branch,Loan_Type,Loan_Amount,Interest_Rate,Loan_Term_Months,Start_Date,End_Date,Loan_Status
0,1,1559,2090,Perez Ltd Branch,Personal,259805,12.43,60,2017-07-03,2022-06-07,Active
1,2,1028,2575,Harris-Marshall Branch,Business,3589336,6.75,24,2017-06-14,2019-06-04,Active
2,3,1164,2433,"Taylor, David and Brown Branch",Auto,4621300,9.86,240,2021-08-10,2041-04-27,Closed
3,4,1100,2368,Robertson and Sons Branch,Home,2380953,7.74,120,2016-02-23,2026-01-01,Approved
4,5,1081,2566,"Parrish, Hall and Adams Branch",Home,2268961,12.96,240,2021-01-05,2040-09-22,Approved

In [11]:
tickets.head()

,Ticket_ID,Customer_ID,Account_ID,Loan_ID,Branch_Name,Issue_Category,Description,Date_Opened,Date_Closed,Priority,Status,Resolution_Remarks,Support_Agent,Channel,Customer_Rating
0,T00001,C0478,A1825,,Gonzalez-Martin Branch,Loan Payment Delay,Client raised loan payment delay.,2017-09-30,2017-10-24,Low,Closed,Card replaced and activated.,Leena Apte,Email,1
1,T00002,C0443,A3583,,Baldwin and Sons Branch,Loan Foreclosure,Client raised loan foreclosure.,2015-04-19,2015-05-12,Critical,In Progress,Card replaced and activated.,Owen Mahajan,In-person,1
2,T00003,C0057,A2616,442,"Porter, Osborne and Mendez Branch",Interest Rate Dispute,Customer reported interest rate dispute.,2016-09-28,2016-10-23,High,Resolved,Loan schedule updated.,Wishi Chhabra,Email,4
3,T00004,C0301,A8786,,"Stafford, Oneal and Williams Branch",Mismatch in Account Statement,Client raised mismatch in account statement.,2019-03-31,2019-04-10,High,Closed,Pending customer verification.,Gabriel Mutti,Email,1
4,T00005,C0238,A3734,,Evans-Mercado Branch,KYC Update Required,System detected kyc update required.,2017-08-11,,Critical,Resolved,Pending customer verification.,Ekani Oza,In-person,2

### Checking null values of account

In [12]:
accounts.isnull().sum()

customer_id        0
account_balance    0
last_updated       0
dtype: int64

### Checking null values of branches

In [13]:
branches.isnull().sum()

Branch_ID             0
Branch_Name           0
City                  0
Manager_Name          0
Total_Employees       0
Branch_Revenue        0
Opening_Date          0
Performance_Rating    0
dtype: int64

### checking null values of credit cards

In [14]:
credit_cards.isnull().sum()

Card_ID            0
Customer_ID        0
Account_ID         0
Branch             0
Card_Number        0
Card_Type          0
Card_Network       0
Credit_Limit       0
Current_Balance    0
Issued_Date        0
Expiry_Date        0
Status             0
dtype: int64

### checking null values of customers

In [15]:
customers.isnull().sum()

customer_id     0
name            0
gender          0
age             0
city            0
account_type    0
join_date       0
dtype: int64

### checking null values of loans

In [16]:
loans.isnull().sum()

Loan_ID             0
Customer_ID         0
Account_ID          0
Branch              0
Loan_Type           0
Loan_Amount         0
Interest_Rate       0
Loan_Term_Months    0
Start_Date          0
End_Date            0
Loan_Status         0
dtype: int64

### checking null values of support tickets

In [17]:
tickets.isnull().sum()

Ticket_ID             0
Customer_ID           0
Account_ID            0
Loan_ID               0
Branch_Name           0
Issue_Category        0
Description           0
Date_Opened           0
Date_Closed           0
Priority              0
Status                0
Resolution_Remarks    0
Support_Agent         0
Channel               0
Customer_Rating       0
dtype: int64

### import sqlite3

In [18]:
import sqlite3

In [19]:
conn = sqlite3.connect("customer_data")
cursor = conn.cursor()

In [20]:
customers.to_sql("customers", conn, if_exists="replace", index=False)

500

### show customer dataset

In [21]:
customers = pd.read_sql("SELECT * FROM customers", conn)
customers

,customer_id,name,gender,age,city,account_type,join_date
0,C0001,Richard Wilson,M,65,Kimberlyburgh,Savings,2023-08-27
1,C0002,Holly Parker,F,41,Port David,Current,2023-12-08
2,C0003,Megan Alvarez,M,46,West Laurieton,Savings,2022-05-25
3,C0004,Nicholas Stewart,F,39,Amyville,Current,2020-11-30
4,C0005,Douglas Anderson,M,70,New Craigport,Current,2023-01-29
...,...,...,...,...,...,...,...
495,C0496,Jennifer Flores,M,50,Mullenland,Savings,2021-04-03
496,C0497,Melissa Martin,M,41,Shermanfurt,Current,2021-12-27
497,C0498,Christopher Johnson,M,69,Nataliemouth,Savings,2022-10-10
498,C0499,Alvin Compton,M,30,Millerstad,Current,2023-06-16
499,C0500,Emily Brooks,M,47,South Louismouth,Savings,2023-10-11

In [22]:
accounts.to_sql("accounts", conn, if_exists="replace", index=False)

500

### Show account dataset

In [23]:
accounts = pd.read_sql("SELECT * FROM accounts", conn)
accounts

    customer_id  account_balance         last_updated
0         C0001        293729.87  2025-05-24 09:46:29
1         C0002        150735.15  2025-05-24 09:46:29
2         C0003        170156.21  2025-05-24 09:46:29
3         C0004        311383.96  2025-05-24 09:46:29
4         C0005         60320.75  2025-05-24 09:46:29
..          ...              ...                  ...
495       C0496        149135.80  2025-05-24 09:46:29
496       C0497        376153.36  2025-05-24 09:46:29
497       C0498        320254.17  2025-05-24 09:46:29
498       C0499        484758.19  2025-05-24 09:46:29
499       C0500        454127.94  2025-05-24 09:46:29

[500 rows x 3 columns]

In [24]:
# Show branches dataset
branches.to_sql("branches", conn, if_exists="replace", index=True)

520

In [25]:
# Show branches dataset
branches = pd.read_sql("SELECT * FROM branches", conn)
branches

,index,Branch_ID,Branch_Name,City,Manager_Name,Total_Employees,Branch_Revenue,Opening_Date,Performance_Rating
0,0,1,"Wang, Mcdonald and Church Branch",Kellitown,Kevin Jones,141,16849288.09,2008-08-01,2
1,1,2,Crawford-Torres Branch,Angelaburgh,Andrea Steele,39,5822279.32,2015-09-17,1
2,2,3,Bridges Inc Branch,Johnsonfort,Michael Coleman,195,2114594.03,2012-07-30,3
3,3,4,Garcia Group Branch,New Kyleberg,Dawn Cooper,144,3390389.63,2018-06-27,2
4,4,5,"Arroyo, Moore and Freeman Branch",West Coryborough,Samantha Kennedy,42,2771910.11,2012-01-04,5
...,...,...,...,...,...,...,...,...,...
515,515,516,Lowery and Sons Branch,Lake Charles,Daniel Hunt,130,6562890.41,2007-06-22,4
516,516,517,Brooks Group Branch,New Christina,Rodney Browning,19,19078758.01,2021-07-20,1
517,517,518,Harris-Marshall Branch,Emilymouth,Lorraine Johnson,177,2801634.32,2011-08-18,5
518,518,519,"Meadows, Taylor and Butler Branch",Port Michael,David Smith,76,17653138.31,2006-05-21,4
519,519,520,Beltran-Nelson Branch,Juliabury,Richard Singleton,171,19520645.33,2010-09-13,1

In [26]:
credit_cards = pd.read_sql("SELECT * FROM credit_cards LIMIT 3",conn)
credit_cards

,Card_ID,Customer_ID,Account_ID,Branch,Card_Number,Card_Type,Card_Network,Credit_Limit,Current_Balance,Issued_Date,Expiry_Date,Status
0,1,1559,2090,Perez Ltd Branch,4960013389083863,Business,Visa,178393,39819.23,2015-04-13,2019-10-27,Expired
1,2,1160,2221,Miller Inc Branch,6511615594078161,Platinum,RuPay,416026,175818.58,2015-01-27,2018-12-18,Expired
2,3,1297,2082,"Miles, Patterson and Murray Branch",6316475255341928,Gold,RuPay,419398,29171.29,2021-06-22,2025-07-19,Active

In [27]:
loans.to_sql("loans", conn, if_exists="replace", index=False)

553

In [28]:
loans = pd.read_sql("SELECT * FROM loans LIMIT 3", conn)
loans

,Loan_ID,Customer_ID,Account_ID,Branch,Loan_Type,Loan_Amount,Interest_Rate,Loan_Term_Months,Start_Date,End_Date,Loan_Status
0,1,1559,2090,Perez Ltd Branch,Personal,259805,12.43,60,2017-07-03,2022-06-07,Active
1,2,1028,2575,Harris-Marshall Branch,Business,3589336,6.75,24,2017-06-14,2019-06-04,Active
2,3,1164,2433,"Taylor, David and Brown Branch",Auto,4621300,9.86,240,2021-08-10,2041-04-27,Closed

In [29]:
tickets.to_sql("tickets", conn, if_exists="replace", index=False)

600

In [30]:
tickets = pd.read_sql("SELECT * FROM tickets LIMIT 3", conn)
tickets

,Ticket_ID,Customer_ID,Account_ID,Loan_ID,Branch_Name,Issue_Category,Description,Date_Opened,Date_Closed,Priority,Status,Resolution_Remarks,Support_Agent,Channel,Customer_Rating
0,T00001,C0478,A1825,,Gonzalez-Martin Branch,Loan Payment Delay,Client raised loan payment delay.,2017-09-30,2017-10-24,Low,Closed,Card replaced and activated.,Leena Apte,Email,1
1,T00002,C0443,A3583,,Baldwin and Sons Branch,Loan Foreclosure,Client raised loan foreclosure.,2015-04-19,2015-05-12,Critical,In Progress,Card replaced and activated.,Owen Mahajan,In-person,1
2,T00003,C0057,A2616,442,"Porter, Osborne and Mendez Branch",Interest Rate Dispute,Customer reported interest rate dispute.,2016-09-28,2016-10-23,High,Resolved,Loan schedule updated.,Wishi Chhabra,Email,4

In [31]:
transactions.to_sql("transactions", conn, if_exists="replace", index=False)

10000

In [32]:
transactions = pd.read_sql("SELECT * FROM transactions LIMIT 3", conn)
transactions

   txn_id customer_id    txn_type    amount             txn_time   status
0  T00001       C0363     deposit  44442.71  2025-02-14 06:26:00  success
1  T00002       C0432     deposit  15737.59  2025-03-27 07:21:21  success
2  T00003       C0084  withdrawal  82150.70  2024-07-31 18:28:06  success

### 1. How many customers exist per city, and what is their average account balance?

In [33]:
query_1 = """SELECT city, COUNT(*) AS customers, 
AVG(account_balance) AS avg_balance
FROM customers c
JOIN accounts a USING (customer_id)
GROUP BY city LIMIT 5;
"""

result = pd.read_sql_query(query_1, conn)

print(result)

            city  customers  avg_balance
0       Adamtown          1     45424.11
1        Alanton          1    392508.77
2  Albertchester          1    387844.67
3  Alexanderstad          1    383016.76
4       Alexfurt          1    403292.20

### 2. Which account type (Savings, Current, Loan, etc.) holds the highest total balance?

In [34]:
query_2 = """SELECT 
    c.account_type,
    SUM(a.account_balance) AS total_balance
FROM customers c
JOIN accounts a 
    ON c.customer_id = a.customer_id
GROUP BY c.account_type
ORDER BY total_balance DESC;"""

result = pd.read_sql_query(query_2, conn)

print(result)

  account_type  total_balance
0      Savings    61880483.18
1      Current    61617575.41

### 3. Who are the top 10 customers by total account balance across all account types?

In [35]:
query_3 = """SELECT 
    c.customer_id,
    c.name,
    c.city,
    c.account_type,
    SUM(a.account_balance) AS total_balance
FROM customers c
JOIN accounts a 
    ON c.customer_id = a.customer_id
GROUP BY c.customer_id, c.name, c.city, c.account_type
ORDER BY total_balance DESC
LIMIT 5;"""

result = pd.read_sql_query(query_3, conn)

print(result)

  customer_id             name             city account_type  total_balance
0       C0314       Amy Nguyen  Margaretchester      Current      498739.49
1       C0011  Carolyn Higgins        Kinghaven      Savings      498317.41
2       C0111     Lisa Russell     Jessicamouth      Current      497040.60
3       C0392   Amber Williams        Johnmouth      Savings      494779.97
4       C0077      Audrey Peck       East Robin      Savings      494699.91

### 4. Which customers opened accounts in 2023 with a balance above ₹1,00,000

In [36]:
query_4 = """SELECT 
    c.customer_id,
    c.name,
    c.city,
    c.account_type,
    a.account_balance,
    c.join_date
FROM customers c
JOIN accounts a 
    ON c.customer_id = a.customer_id
WHERE strftime('%Y', c.join_date) = '2023'
  AND a.account_balance > 100000
ORDER BY a.account_balance DESC LIMIT 5 ;"""

result = pd.read_sql_query(query_4, conn)

print(result)

  customer_id                   name            city account_type  \
0       C0077            Audrey Peck      East Robin      Savings
1       C0499          Alvin Compton      Millerstad      Current
2       C0317        Denise Campbell  Villanuevafurt      Current
3       C0208  Mr. Jimmy Gonzales MD      Amandaberg      Savings
4       C0411       Brendan Williams     New Jayfort      Current

   account_balance   join_date
0        494699.91  2023-03-21
1        484758.19  2023-06-16
2        481746.58  2023-02-08
3        476044.52  2023-11-17
4        466807.80  2023-08-04

### 5. What is the total transaction volume (sum of amounts) by transaction type

In [37]:
query_5 = """SELECT 
    txn_type,
    SUM(amount) AS total_transaction_volume
FROM transactions
GROUP BY txn_type
ORDER BY total_transaction_volume DESC;
"""

result = pd.read_sql_query(query_5, conn)

print(result)

       txn_type  total_transaction_volume
0       deposit              1.975748e+08
1    withdrawal              1.513873e+08
2      purchase              7.383403e+07
3      transfer              5.059280e+07
4  online fraud              2.382950e+07

### 6. Which accounts have more than 3 failed transactions in a single month?

In [38]:
query_6 = """SELECT 
    customer_id,
    strftime('%Y-%m', txn_time) AS txn_month,
    COUNT(*) AS failed_txn_count
FROM transactions
WHERE status = 'failed'
GROUP BY customer_id, txn_month
HAVING COUNT(*) > 2
ORDER BY failed_txn_count DESC LIMIT 5;
"""

result = pd.read_sql_query(query_6, conn)

print(result)

  customer_id txn_month  failed_txn_count
0       C0035   2024-11                 3
1       C0092   2024-07                 3
2       C0148   2024-08                 3
3       C0278   2024-07                 3
4       C0350   2024-12                 3

### 7. Which are the top 5 branches by total transaction volume in the last 6 months?

In [39]:
query_7 = """SELECT
    c.name,
    B.Branch_Name,
    SUM(T.amount) AS total_transaction_volume
FROM
Transactions T
JOIN Customers C ON T.customer_id = C.customer_id
JOIN Branches B ON C.city = B.City  
WHERE
    T.txn_time >= strftime('%Y-%m-%d %H:%M:%S', 'now', '-6 months')
GROUP BY B.Branch_Name
ORDER BY total_transaction_volume DESC
LIMIT 5;

"""

result = pd.read_sql(query_7, conn)

print(result)

Empty DataFrame
Columns: [name, Branch_Name, total_transaction_volume]
Index: []

###  8. Which accounts have 5 or more high-value transactions above ₹9999

In [40]:
query_8 = """SELECT
    T.customer_id,
    COUNT(T.txn_id) AS high_value_transaction_count
FROM
    Transactions T
WHERE
    T.amount >= 95000 
    AND T.status = 'success' 
GROUP BY
    T.customer_id
HAVING
    COUNT(T.txn_id) >= 5
ORDER BY
    high_value_transaction_count DESC LIMIT 5;"""
result = pd.read_sql_query(query_8, conn)

print(result)

  customer_id  high_value_transaction_count
0       C0285                             5
1       C0124                             5

### 9. What is the average loan amount and interest rate by loan type (Personal, Auto, Home, etc.)?

In [41]:
query_9 = """SELECT 
    Loan_Type,
    AVG(Loan_Amount) AS avg_loan_amount,
    AVG(Interest_Rate) AS avg_interest_rate
FROM loans
GROUP BY Loan_Type
ORDER BY avg_loan_amount DESC;
"""

result = pd.read_sql_query(query_9, conn)

print(result)

   Loan_Type  avg_loan_amount  avg_interest_rate
0   Business     2.793969e+06          10.625437
1   Personal     2.461544e+06          10.463391
2       Auto     2.399261e+06          10.532523
3  Education     2.393948e+06          10.114393
4       Home     2.344577e+06          10.872479

### 10. Which customers currently hold more than one active or approved loan?

In [42]:
query_10 = """SELECT
    Customer_ID,
    COUNT(*) AS active_loans
FROM loans
WHERE Loan_Status IN ('Active', 'Approved')
GROUP BY Customer_ID
HAVING COUNT(*) > 1
ORDER BY active_loans DESC LIMIT 5;
"""

result = pd.read_sql_query(query_10, conn)

print(result)

   Customer_ID  active_loans
0         1231             4
1         1010             4
2         1502             3
3         1488             3
4         1470             3

### 11. Who are the top 5 customers with the highest outstanding (non-closed) loan amounts?

In [43]:
query_11 = """SELECT
    Customer_ID,
    SUM(Loan_Amount) AS total_outstanding
FROM loans
WHERE Loan_Status != 'Closed'
GROUP BY Customer_ID
ORDER BY total_outstanding DESC
LIMIT 5;
"""

result = pd.read_sql_query(query_11, conn)

print(result)

   Customer_ID  total_outstanding
0         1455           15389458
1         1383           13279523
2         1088           11960853
3         1236           11783260
4         1010           11747032

### 12. Which branch holds the highest total account balance?

In [44]:
query_12 = """SELECT 
    b.Branch_Name,
    SUM(a.account_balance) AS total_balance
FROM accounts a
JOIN customers c 
    ON a.customer_id = c.customer_id
JOIN branches b
    ON c.city = b.City
GROUP BY b.Branch_Name
ORDER BY total_balance DESC
LIMIT 5;
"""

result = pd.read_sql_query(query_12, conn)

print(result)

               Branch_Name  total_balance
0     Hernandez PLC Branch      936939.15
1       Johnson Ltd Branch      793265.69
2  Johnson and Sons Branch      788167.26
3         Adams LLC Branch      748401.12
4  Williams-Edwards Branch      711970.49

### 13. What is the branch performance summary showing total customers, total loans, and transaction volume?

In [45]:
query_13 = """SELECT 
    b.Branch_Name,
    COUNT(DISTINCT c.customer_id) AS total_customers,
    COUNT(DISTINCT l.Loan_ID) AS total_loans,
    SUM(t.amount) AS total_transaction_volume
FROM branches b
LEFT JOIN customers c ON c.city = b.City
LEFT JOIN loans l ON l.Branch = b.Branch_Name
LEFT JOIN transactions t ON t.customer_id = b.Branch_Name
GROUP BY b.Branch_Name;"""

result = pd.read_sql_query(query_13, conn)

print(result)

                              Branch_Name  total_customers  total_loans  \
0         Acosta, Murphy and Rojas Branch                1            3
1                        Adams LLC Branch                2            2
2    Adams, Mitchell and Schneider Branch                1            1
3                       Adkins Inc Branch                1            0
4                    Aguirre Group Branch                1            0
..                                    ...              ...          ...
505                     Wright Ltd Branch                2            0
506                     Wright PLC Branch                1            0
507                      Young PLC Branch                1            1
508  Zavala, Ferguson and Williams Branch                1            1
509                  Zimmerman PLC Branch                1            1

    total_transaction_volume
0                       None
1                       None
2                       None
3                       None
4                       None
..                       ...
505                     None
506                     None
507                     None
508                     None
509                     None

[510 rows x 4 columns]

### 14. Which issue categories have the longest average resolution time?

In [46]:
query_14 = """
SELECT 
    issue_category,
    AVG(JULIANDAY(date_closed) - JULIANDAY(date_opened)) AS avg_resolution_days
FROM tickets
WHERE date_opened IS NOT NULL
GROUP BY issue_category
ORDER BY avg_resolution_days DESC
"""

result = pd.read_sql_query(query_14, conn)

print(result)

                   Issue_Category  avg_resolution_days
0                Card Not Working            18.500000
1   Mismatch in Account Statement            17.903226
2       Debit Card Delivery Delay            17.814815
3              UPI Payment Failed            17.458333
4         Account Closure Request            17.322581
5                  Account Frozen            17.115385
6                Loan Foreclosure            16.583333
7                   Cheque Bounce            16.000000
8           EMI Auto-debit Failed            15.976190
9          Online Transfer Failed            15.476190
10            KYC Update Required            15.407407
11          Interest Rate Dispute            15.310345
12           Account Access Issue            14.884615
13             Loan Payment Delay            14.711538
14       Unauthorized Transaction            13.107143

### 15. Which support agents have resolved the most critical tickets with high customer ratings (≥4)?

In [47]:
query_15 = """SELECT 
    support_agent,
    COUNT(*) AS resolved_critical_high_rated_tickets
FROM tickets
WHERE 
    priority = 'Critical'
    AND status = 'Resolved'
    AND customer_rating >= 4
GROUP BY support_agent
ORDER BY resolved_critical_high_rated_tickets DESC;
"""

result = pd.read_sql_query(query_15, conn)

print(result)

      Support_Agent  resolved_critical_high_rated_tickets
0      Owen Mahajan                                     2
1     Chanakya Natt                                     2
2  Wriddhish Sarraf                                     1
3        Veda Samra                                     1
4       Vansha Sood                                     1
5     Gabriel Mutti                                     1
6      Advik Bhagat                                     1

###

### 16. How many customers exist in each city?

In [49]:
query_16 = """SELECT city, COUNT(*) AS total_customers
FROM customers
GROUP BY city;
"""

result = pd.read_sql_query(query_16, conn)

print(result)

               city  total_customers
0          Adamtown                1
1           Alanton                1
2     Albertchester                1
3     Alexanderstad                1
4          Alexfurt                1
..              ...              ...
482    Wintershaven                1
483        Woodfort                1
484       Yanghaven                1
485  Zacharychester                1
486     Zacharyport                1

[487 rows x 2 columns]

### 17. What is the average account balance by account type?

In [53]:
query_17 = """SELECT account_type, AVG(account_balance) AS avg_balance
FROM customers c
JOIN accounts a ON c.customer_id = a.customer_id
GROUP BY account_type;"""

result = pd.read_sql_query(query_17,conn)

print(result)

  account_type    avg_balance
0      Current  245488.348247
1      Savings  248515.996707

### 18. Who are the top 10 customers by total account balance?

In [56]:
query_18 = """SELECT c.name, SUM(a.account_balance) AS total_balance
FROM customers c
JOIN accounts a ON c.customer_id = a.customer_id
GROUP BY c.customer_id
ORDER BY total_balance DESC
LIMIT 10;"""

result = pd.read_sql_query(query_18,conn)

print(result)

                 name  total_balance
0          Amy Nguyen      498739.49
1     Carolyn Higgins      498317.41
2        Lisa Russell      497040.60
3      Amber Williams      494779.97
4         Audrey Peck      494699.91
5       Alvin Compton      484758.19
6  Sharon Bennett DVM      482746.37
7     Denise Campbell      481746.58
8       Jeffrey Smith      481568.14
9          Ann Crosby      479706.41

### 19. Which customers opened accounts in 2023 with balance > ₹1,00,000?

In [58]:
query_19 = """SELECT c.customer_id, c.name, a.account_balance
FROM customers c
JOIN accounts a ON c.customer_id = a.customer_id
WHERE strftime('%Y', c.join_date) = '2023'
  AND a.account_balance > 100000;"""

result = pd.read_sql_query(query_19,conn)

print(result)

    customer_id             name  account_balance
0         C0001   Richard Wilson        293729.87
1         C0002     Holly Parker        150735.15
2         C0007   Jasmine Morris        291736.90
3         C0017  Jesus Davenport        345239.48
4         C0021    William Jones        185053.68
..          ...              ...              ...
108       C0478     Ryan Jackson        400751.68
109       C0484      Rodney Cruz        150039.17
110       C0489    Andrea Austin        407686.39
111       C0499    Alvin Compton        484758.19
112       C0500     Emily Brooks        454127.94

[113 rows x 3 columns]

### 20. Total transaction volume by transaction type

In [59]:
query_20 = """SELECT txn_type, SUM(amount) AS total_volume
FROM transactions
GROUP BY txn_type;"""

result = pd.read_sql_query(query_20,conn)

print(result)

       txn_type  total_volume
0       deposit  1.975748e+08
1  online fraud  2.382950e+07
2      purchase  7.383403e+07
3      transfer  5.059280e+07
4    withdrawal  1.513873e+08

### 21.Support agents who resolved most critical tickets with rating ≥ 4

In [62]:
query_21 = """SELECT 
    support_agent,
    COUNT(*) AS resolved_tickets
FROM tickets
WHERE priority = 'Critical'
  AND customer_rating >= 4
  AND status = 'Resolved'
GROUP BY support_agent
ORDER BY resolved_tickets DESC;
"""

result = pd.read_sql_query(query_21,conn)

print(result)

      Support_Agent  resolved_tickets
0      Owen Mahajan                 2
1     Chanakya Natt                 2
2  Wriddhish Sarraf                 1
3        Veda Samra                 1
4       Vansha Sood                 1
5     Gabriel Mutti                 1
6      Advik Bhagat                 1

### 22. Retrieve all customers who have not updated their account balance in the last 30 days.

In [63]:
query_22 = """SELECT *
FROM accounts
WHERE last_updated < DATE('now', '-30 days');
"""

result = pd.read_sql_query(query_22,conn)

print(result)

    customer_id  account_balance         last_updated
0         C0001        293729.87  2025-05-24 09:46:29
1         C0002        150735.15  2025-05-24 09:46:29
2         C0003        170156.21  2025-05-24 09:46:29
3         C0004        311383.96  2025-05-24 09:46:29
4         C0005         60320.75  2025-05-24 09:46:29
..          ...              ...                  ...
495       C0496        149135.80  2025-05-24 09:46:29
496       C0497        376153.36  2025-05-24 09:46:29
497       C0498        320254.17  2025-05-24 09:46:29
498       C0499        484758.19  2025-05-24 09:46:29
499       C0500        454127.94  2025-05-24 09:46:29

[500 rows x 3 columns]

### 23. Find the average age of customers for each account type.

In [64]:
query_23 = """SELECT account_type, AVG(age) AS avg_age
FROM customers
GROUP BY account_type;
"""

result = pd.read_sql_query(query_23,conn)

print(result)

  account_type    avg_age
0      Current  44.235060
1      Savings  44.562249

### 24. Count how many transactions happened on weekends.

In [65]:
query_24 = """SELECT COUNT(*) AS weekend_transactions
FROM transactions
WHERE strftime('%w', txn_time) IN ('0','6');
"""

result = pd.read_sql_query(query_24,conn)

print(result)

   weekend_transactions
0                  2888

### 25. Find customers who made at least one transaction above ₹50,000.

In [68]:
query_25 = """SELECT DISTINCT customer_id
FROM transactions
WHERE amount > 50000;
"""

result = pd.read_sql_query(query_25,conn)

print(result)

    customer_id
0         C0084
1         C0485
2         C0093
3         C0443
4         C0080
..          ...
495       C0467
496       C0347
497       C0416
498       C0159
499       C0271

[500 rows x 1 columns]

### 26. Get the total number of failed transactions per customer.

In [69]:
query_26 = """SELECT customer_id, COUNT(*) AS failed_count
FROM transactions
WHERE status = 'failed'
GROUP BY customer_id;
"""

result = pd.read_sql_query(query_26,conn)

print(result)

    customer_id  failed_count
0         C0001             4
1         C0002             3
2         C0003             4
3         C0004             2
4         C0005             3
..          ...           ...
469       C0496             3
470       C0497             1
471       C0498             5
472       C0499             3
473       C0500             4

[474 rows x 2 columns]

### 27. Find the 10 earliest registered customers.

In [70]:
query_27 = """SELECT *
FROM customers
ORDER BY join_date
LIMIT 10;
"""

result = pd.read_sql_query(query_27,conn)

print(result)

  customer_id              name gender  age            city account_type  \
0       C0292    Ian Montgomery      F   36     Angelaburgh      Current
1       C0062        Candice Le      F   53      West Scott      Current
2       C0015  Mr. Caleb Wagner      M   41       Terryside      Savings
3       C0016     Kelly Jenkins      M   63     Zacharyport      Savings
4       C0407    Regina Stevens      M   21     New Richard      Current
5       C0345     Rachael Moore      M   24       Lake Sean      Savings
6       C0234   Patricia Valdez      F   54  Gregoryborough      Current
7       C0298      Scott French      F   20     Matthewtown      Current
8       C0353      Linda Watson      M   21        Huffberg      Current
9       C0258        Ruth Smith      F   57  Christinamouth      Current

    join_date
0  2020-05-24
1  2020-05-31
2  2020-06-05
3  2020-06-06
4  2020-06-07
5  2020-06-10
6  2020-06-19
7  2020-06-20
8  2020-06-22
9  2020-06-24

### 28. Retrieve customers who live in the same city as more than 2 other customers.

In [73]:
query_28 = """SELECT city, COUNT(*) AS num_customers
FROM customers
GROUP BY city
HAVING num_customers > 2;
"""

result = pd.read_sql_query(query_28,conn)

print(result)

           city  num_customers
0  Jessicamouth              3
1    Port David              3

### 29. Find the count of transactions by status (success/failed).

In [ ]:
query_29 = """SELECT status, COUNT(*) AS count
FROM transactions
GROUP BY status;
"""

result = pd.read_sql_query(query_29,conn)

print(result)

    status  count
0   failed   1497
1  success   8503

### 30. Show customers whose name starts with 'A'.

In [80]:
query_30 = """SELECT *
FROM customers
WHERE name LIKE 'A%';
"""

result = pd.read_sql_query(query_30,conn)

print(result)

   customer_id                name gender  age                city  \
0        C0013     Alicia Cohen MD      F   45    West Williamview
1        C0019      Anthony Jordan      M   43    Macdonaldborough
2        C0028          Adam Jones      F   49   North Colleenstad
3        C0067       Ashley Becker      M   22        Phillipsbury
4        C0073         Ana Cochran      M   19         Gordonmouth
5        C0077         Audrey Peck      M   60          East Robin
6        C0080       Angela Warren      M   44        Sanchezmouth
7        C0085        April Cooper      M   60      South Danielle
8        C0105          Anna Davis      M   65      Port Scotttown
9        C0118        Aaron Murphy      M   41       Lake Josebury
10       C0120          Ann Phelps      F   40     New Michaelfurt
11       C0132    Amanda Armstrong      F   40           Frankberg
12       C0136        Anthony Ross      M   62   East Victoriaside
13       C0146          Ann Crosby      M   20  North Christinaton
14       C0152         Alvin Perry      F   64       Brendachester
15       C0158     Andrew Reynolds      F   36      Hernandezshire
16       C0163         Ashley Buck      M   45       West Tommouth
17       C0168      Anthony Walker      F   54       Rodriguezberg
18       C0178        Anna Stewart      M   22        Port Phillip
19       C0212     Austin Phillips      M   46         Wilsonmouth
20       C0214    Alejandro Martin      M   24        Edwardsville
21       C0216   Ashley Williamson      M   25        Petersonstad
22       C0219         Anna Ritter      M   34        West William
23       C0225       Amanda Carter      M   39         West Kendra
24       C0237         Alice Young      M   37         Douglasland
25       C0247         Andrew Moss      F   58  East Sergioborough
26       C0256        Andrea Lewis      M   70         West Bonnie
27       C0314          Amy Nguyen      F   65     Margaretchester
28       C0319        Ashley Smith      M   70        Port Kathryn
29       C0320       Andrew Patton      M   45          East April
30       C0329  Alexandra Holloway      F   27         Richardview
31       C0339     Alicia Campbell      M   21           Karenport
32       C0348            Amy Neal      M   53          Walkerside
33       C0351     Andrew Robinson      M   29         Terrellfort
34       C0354  Anthony Washington      M   24          Shelbybury
35       C0376          Alex Beard      F   41         Markchester
36       C0377        Amanda David      F   34      East Davidberg
37       C0381     Alejandra Smith      M   37     South Heidiport
38       C0392      Amber Williams      M   70           Johnmouth
39       C0396    Andrew Casey DDS      F   47           Nunezbury
40       C0400        Anthony Shea      F   53          Murraytown
41       C0425       Andrea Juarez      M   25     West Danielport
42       C0431        Alicia Clark      M   50         Barbermouth
43       C0432   Anthony Maldonado      M   69   West Jessicamouth
44       C0435       Arthur Jacobs      F   26     South Maryshire
45       C0467       Abigail Doyle      F   48          Lake Tanya
46       C0469        Anthony Ross      F   26        Hollyborough
47       C0472         Amanda Rice      F   31      Stephanieville
48       C0480        Aimee Stokes      F   47         Darrenmouth
49       C0489       Andrea Austin      M   63         West Ronald
50       C0499       Alvin Compton      M   30          Millerstad

   account_type   join_date
0       Current  2022-09-16
1       Savings  2024-02-03
2       Savings  2023-07-19
3       Current  2021-03-29
4       Savings  2021-06-17
5       Savings  2023-03-21
6       Current  2021-02-06
7       Current  2020-11-08
8       Savings  2023-09-16
9       Current  2021-07-06
10      Current  2021-02-09
11      Savings  2022-08-18
12      Current  2023-07-04
13      Savings  2022-03-30
14      Current  2024-03-01
15      Savings  2023-05-29
16      Savings  2022-01-01
17      Savings  2024-05-22
18      Savings  2021-04-27
19      Savings  2021-08-18
20      Savings  2023-01-20
21      Savings  2024-01-27
22      Savings  2022-12-20
23      Savings  2020-08-31
24      Current  2021-04-14
25      Savings  2021-12-31
26      Savings  2021-06-23
27      Current  2020-08-25
28      Savings  2020-12-05
29      Savings  2020-11-05
30      Current  2022-09-18
31      Savings  2020-12-11
32      Savings  2022-08-23
33      Savings  2023-04-11
34      Current  2021-04-27
35      Savings  2023-02-19
36      Current  2021-07-18
37      Savings  2022-06-13
38      Savings  2022-01-04
39      Savings  2020-07-13
40      Savings  2024-05-03
41      Savings  2021-09-08
42      Current  2021-05-28
43      Current  2023-08-21
44      Current  2021-09-22
45      Savings  2022-06-06
46      Current  2021-06-02
47      Current  2022-08-31
48      Savings  2020-12-04
49      Savings  2023-01-28
50      Current  2023-06-16